/*
## Q1

SELECT name FROM Facilities WHERE membercost > 0;

## Q2

SELECT COUNT(*) FROM Facilities WHERE membercost = 0;

## Q3

SELECT facid, name, membercost, monthlymaintenance 
FROM Facilities 
WHERE membercost > 0 AND
membercost < .2 * monthlymaintenance;

## Q4

SELECT * FROM Facilities WHERE facid IN (1, 5);

## Q5

SELECT name, monthlymaintenance, 
(CASE WHEN monthlymaintenance < 100 THEN "cheap"
ELSE "expensive" END) AS category
FROM Facilities;

## Q6

SELECT firstname, surname
FROM Members
WHERE joindate = 
(SELECT MAX(joindate)
 FROM Members);

Or 

SELECT firstname, surname
FROM Members
ORDER BY joindate DESC
LIMIT 1;

## Q7

SELECT DISTINCT(CONCAT(firstname , " ", surname)) AS member_name, name
FROM Members
JOIN Bookings
USING (memid)
JOIN Facilities
USING (facid)
WHERE name LIKE "tennis%"
ORDER BY member_name;

## Q8

SELECT name AS facility, CONCAT(firstname, " " , Surname) AS name,
(CASE WHEN memid = 0 THEN slotS * GUESTCOST
 ELSE membercost * SLOTS END) AS cost
FROM Facilities
LEFT JOIN Bookings
USING (facid)
LEFT JOIN Members
USING (memid)
WHERE DATE(starttime) = '2012-09-14' AND 
((memid = 0 AND guestcost * slots> 30) OR 
 (memid != 0 AND membercost * slots > 30))
 ORDER BY cost DESC;
 
 ## Q9
 
 SELECT facility, name, cost
FROM (SELECT f.name AS facility, CONCAT(m.firstname, " " , m.Surname) AS name,
(CASE WHEN m.memid = 0 THEN b.slotS * f.guestcost
 ELSE f.membercost * b.slots END) AS cost
FROM Facilities AS f
LEFT JOIN Bookings AS b
USING (facid)
LEFT JOIN Members AS m
USING (memid)
WHERE DATE(b.starttime) = '2012-09-14')
WHERE cost > 30
ORDER BY cost DESC;

In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
database = "sqlite:///sqlite_db_pythonsqlite.db"

engine = create_engine(database)

In [3]:
##  Q10
query = '''SELECT name, 
SUM(CASE WHEN memid = 0 THEN guestcost * slots
ELSE membercost * slots END) AS total_revenue
FROM Facilities AS f 
LEFT JOIN Bookings AS b
ON (f.facid = b.facid)
GROUP BY name
HAVING total_revenue < 1000
ORDER BY total_revenue'''

df = pd.read_sql_query(query, engine)
print(df.head())

            name  total_revenue
0   Table Tennis            180
1  Snooker Table            240
2     Pool Table            270

In [4]:
## Q11
query = '''SELECT m1.surname AS member_surname, m1.firstname AS member_firstname, 
m2.surname AS recommendor_surname, m2.firstname AS recommender_firstname
FROM Members AS m1
INNER JOIN Members AS m2
on m1.recommendedby = m2.memid
ORDER BY member_surname, member_firstname;'''

df = pd.read_sql_query(query, engine)
print(df.head())

  member_surname member_firstname recommendor_surname recommender_firstname
0          Bader         Florence            Stibbons                Ponder
1          Baker             Anne            Stibbons                Ponder
2          Baker          Timothy             Farrell                Jemima
3         Boothe              Tim              Rownam                   Tim
4        Butters           Gerald               Smith                Darren

In [5]:
## Q12
query = '''SELECT name, ROUND(SUM(slots)/2, 0) 
FROM Facilities
INNER JOIN (SELECT slots, facid
            FROM Bookings 
            WHERE memid != 0) AS sub
USING (facid)
GROUP BY name;'''

# Dividing the sum by 2 since each slot is half an hour

df = pd.read_sql_query(query, engine)
print(df.head())

              name  ROUND(SUM(slots)/2, 0)
0  Badminton Court                   543.0
1   Massage Room 1                   442.0
2   Massage Room 2                    27.0
3       Pool Table                   428.0
4    Snooker Table                   430.0

In [6]:
## Q13
query = '''SELECT name, ROUND(SUM(slots)/2, 0), month
FROM Facilities
INNER JOIN (SELECT slots, facid, strftime('%m', starttime) as month
            FROM Bookings 
            WHERE memid != 0) AS sub
USING (facid)
GROUP BY name, month
ORDER BY month;'''

# Dividing the sum by 2 since each slot is half an hour

df = pd.read_sql_query(query, engine)
print(df.head())

              name  ROUND(SUM(slots)/2, 0) month
0  Badminton Court                    82.0    07
1   Massage Room 1                    83.0    07
2   Massage Room 2                     4.0    07
3       Pool Table                    55.0    07
4    Snooker Table                    70.0    07